Revit 2024 API
AppearanceAssetEditScope Members
The AppearanceAssetEditScope type exposes the following members.
Constructors
Name | Description
AppearanceAssetEditScope
 Constructs a new instance of an AppearanceAssetEditScope.
Methods
Name | Description
Cancel
 Cancels the edit scope.
Commit
 Finishes the edit scope.
Dispose
Releases all resources used by the AppearanceAssetEditScope
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Start
 Starts the edit scope.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsActive
 Identifies if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace